webroot/_test/simulators/netaxept/netaxept.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="Netaxept" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:tns="http://tempuri.org/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:i0="http://BBS.EPayment" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata"><wsp:Policy wsu:Id="Endpoint_policy"><wsp:ExactlyOne><wsp:All><sp:TransportBinding xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy"><wsp:Policy><sp:TransportToken><wsp:Policy><sp:HttpsToken RequireClientCertificate="false"/></wsp:Policy></sp:TransportToken><sp:AlgorithmSuite><wsp:Policy><sp:Basic256/></wsp:Policy></sp:AlgorithmSuite><sp:Layout><wsp:Policy><sp:Strict/></wsp:Policy></sp:Layout></wsp:Policy></sp:TransportBinding></wsp:All></wsp:ExactlyOne></wsp:Policy><wsdl:import namespace="http://BBS.EPayment" location="https://epayment-test.bbs.no/Netaxept.svc?wsdl=wsdl0"/><wsdl:types/><wsdl:binding name="Endpoint" type="i0:INetaxept"><wsp:PolicyReference URI="#Endpoint_policy"/><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="Register"><soap:operation soapAction="http://BBS.EPayment/INetaxept/Register" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output><wsdl:fault name="MerchantTranslationExceptionFault"><soap:fault name="MerchantTranslationExceptionFault" use="literal"/></wsdl:fault><wsdl:fault name="ValidationExceptionFault"><soap:fault name="ValidationExceptionFault" use="literal"/></wsdl:fault><wsdl:fault name="SecurityExceptionFault"><soap:fault name="SecurityExceptionFault" use="literal"/></wsdl:fault><wsdl:fault name="AuthenticationExceptionFault"><soap:fault name="AuthenticationExceptionFault" use="literal"/></wsdl:fault><wsdl:fault name="UniqueTransactionIdExceptionFault"><soap:fault name="UniqueTransactionIdExceptionFault" use="literal"/></wsdl:fault><wsdl:fault name="GenericErrorFault"><soap:fault name="GenericErrorFault" use="literal"/></wsdl:fault><wsdl:fault name="BBSExceptionFault"><soap:fault name="BBSExceptionFault" use="literal"/></wsdl:fault></wsdl:operation><wsdl:operation name="Query"><soap:operation soapAction="http://BBS.EPayment/INetaxept/Query" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output><wsdl:fault name="QueryExceptionFault"><soap:fault name="QueryExceptionFault" use="literal"/></wsdl:fault><wsdl:fault name="AuthenticationExceptionFault"><soap:fault name="AuthenticationExceptionFault" use="literal"/></wsdl:fault></wsdl:operation><wsdl:operation name="Process"><soap:operation soapAction="http://BBS.EPayment/INetaxept/Process" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output><wsdl:fault name="GenericErrorFault"><soap:fault name="GenericErrorFault" use="literal"/></wsdl:fault><wsdl:fault name="NotSupportedExceptionFault"><soap:fault name="NotSupportedExceptionFault" use="literal"/></wsdl:fault><wsdl:fault name="AuthenticationExceptionFault"><soap:fault name="AuthenticationExceptionFault" use="literal"/></wsdl:fault><wsdl:fault name="MerchantTranslationExceptionFault"><soap:fault name="MerchantTranslationExceptionFault" use="literal"/></wsdl:fault><wsdl:fault name="ValidationExceptionFault"><soap:fault name="ValidationExceptionFault" use="literal"/></wsdl:fault><wsdl:fault name="BBSExceptionFault"><soap:fault name="BBSExceptionFault" use="literal"/></wsdl:fault></wsdl:operation><wsdl:operation name="Batch"><soap:operation soapAction="http://BBS.EPayment/INetaxept/Batch" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output><wsdl:fault name="AuthenticationExceptionFault"><soap:fault name="AuthenticationExceptionFault" use="literal"/></wsdl:fault><wsdl:fault name="GenericErrorFault"><soap:fault name="GenericErrorFault" use="literal"/></wsdl:fault><wsdl:fault name="MerchantTranslationExceptionFault"><soap:fault name="MerchantTranslationExceptionFault" use="literal"/></wsdl:fault></wsdl:operation><wsdl:operation name="Recon"><soap:operation soapAction="http://BBS.EPayment/INetaxept/Recon" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output><wsdl:fault name="SecurityExceptionFault"><soap:fault name="SecurityExceptionFault" use="literal"/></wsdl:fault><wsdl:fault name="ValidationExceptionFault"><soap:fault name="ValidationExceptionFault" use="literal"/></wsdl:fault><wsdl:fault name="GenericErrorFault"><soap:fault name="GenericErrorFault" use="literal"/></wsdl:fault><wsdl:fault name="AuthenticationExceptionFault"><soap:fault name="AuthenticationExceptionFault" use="literal"/></wsdl:fault><wsdl:fault name="MerchantTranslationExceptionFault"><soap:fault name="MerchantTranslationExceptionFault" use="literal"/></wsdl:fault></wsdl:operation><wsdl:operation name="CheckAvailability"><soap:operation soapAction="http://BBS.EPayment/INetaxept/CheckAvailability" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="Netaxept"><wsdl:port name="Endpoint" binding="tns:Endpoint"><soap:address location="http://mpoint.local.cellpointmobile.com/_test/simulators/netaxept/netaxept.php"/></wsdl:port></wsdl:service></wsdl:definitions>